{
    "name": "CHUN KAI LIN",
    "contact": {
        "Address": "Hong Kong",
        "Email": "lamjunkai5@gmail.com",
        "linkedin": "https://www.linkedin.com/in/chun-kai-lin-941067398/"
    },
    "summary": "My name is Chun Kai Lam\nMy goal isn't just to be a strong developer but someone you can count on to deliver, stay calm, and solve problems when things don't go as planned.\nFront End Engineer who thrives in building startups from the ground up, no matter the industry.\nThroughout my career I have worked across Hong Kong, the UK, and the US in teams ranging from 10 to 100 people, contributing to product development in international and fast-moving environments.\nOver the years I have built:\n- B2B SaaS large-scale platforms.\n- Education platforms with adaptive learning, gamified dashboards, and real-time progress tracking.\n- Restaurant & delivery apps for online ordering, loyalty/points, and full payment/dispatch workflows.\n- E-commerce systems handling product catalogs, checkout, coupons, and logistics integrations.\nI am passionate about clean, scalable code and about collaborating with designers, product managers, and stakeholders to translate requirements into meaningful solutions.\nMy work consistently reduces technical debt, improves time to-market, and enhances user satisfaction through measurable improvements in performance and usability.\nAs I continue to grow my career, I'm especially motivated by projects where technology directly improves user experience - whether that's reducing waiting time in a restaurant, enabling faster deliveries, or making learning more accessible through digital platforms.",
    "references": [],
    "experience": [
        {
            "title": "Software Engineer",
            "company": "Estech Digital (Los Angeles, California)",
            "period": "NOV 2022 - SEP 2025",
            "skills": [
                "React.js",
                "Next.js",
                "Angular",
                "Vue",
                "TailwindCSS",
                "Golang",
                "Nest.js",
                "Django",
                "AWS",
                "GCP",
                "TDD",
                "etc"
            ],
            "summary": "https://drive.google.com/drive/folders/1bIOIJRrcfF6bfTVy-lebN1tiaqDEedjx?usp=drive_link\nI have developed a large-scale B2B SaaS platform using PHP Laravel, Redux.js, ReactJs + Material UI + React Router + TypeScript, AWS CDK, Buddy CI, AWS, RDS Aurora MySQL, AWS Lambda, Elasticache Redis, S3, EKS/ECR, Cloud.\nAs you can see in my attached file, I have implemented following features in these projects:",
            "highlights": [
                "B2B SaaS application to allow end users to effectively manage and get reporting for their visitors.",
                "Customizable user types and check-in workflows for each visitor type.",
                "Configurable alerts and notifications for check-in, check-out, delivery, etc.",
                "Robust reporting for visitor data.",
                "Visitor training and screening features.",
                "Touchless check-ins and visitor badge printing to allow visitor access to restricted locations.",
                "Multilingual support and ability for end users to have different workflows for each visitor locale.",
                "Integration with Azure AD and Active Directory for syncing location employees.",
                "Interactive notification integrations with MS Teams and Slack to assist workflows.",
                "SMS integration.",
                "SMS Blast functionality to quickly send notifications to all visitors or everyone in case of emergencies."
            ]
        },
        {
            "title": "Frontend Engineer",
            "company": "UHP (Germany)",
            "period": "AUG 2020 - OCT 2022",
            "skills": [
                "React.js",
                "Vue",
                "Bootstrap",
                "Webpack",
                "InvisionApp",
                "Balsamiq",
                "CircleCI",
                "Jenkins",
                "AWS"
            ],
            "summary": "https://drive.google.com/drive/folders/10GW8N0R9kxavR16MzXrk6u5N1iuMBhAN?usp=drive_link\nAt Refutbol, I worked as a Frontend Developer on a high-performance sports analytics platform. The product processed over 1.5K events and 8.5K sub-events per match, allowing users to analyze referees, teams, and players in real time.\nI developed interactive and scalable UI features using Vue.js, optimized complex data visualizations, and helped build customizable tagging and playlist tools.\nMy focus was on delivering a smooth user experience despite heavy data workloads.",
            "highlights": [                
                "Developed a real-time AI-powered task prioritization system using Angular and RxJS, improving team productivity by 30%",
                "Implemented WebSocket integration for live updates and notifications, handling 50K concurrent users",
                "Built reusable UI components library with NgRx state management, reducing development time by 40%",
                "Set up automated testing pipeline with Jest and Cypress, achieving 85% test coverage"
            ]
        },
        {
            "title": "Frontend developer",
            "company": "Orient Overseas Container Line (Hong Kong)",
            "period": "OCT 2019 - JUL 2020",
            "skills": [],
            "summary": "https://miro.com/app/board/uXjVJ1knH1s=/?focusWidget=3458764632024015081\nhttps://drive.google.com/file/d/1BFbi4X2xXstgHcfkRHa5upGZDOylHaUb/view?usp=drive_link\nI have designed and built a scalable lead generation and data scraping platform using Python, Django, and FastAPI. The system automatically collected RCS numbers, VAT numbers, and detailed company data from multiple structured and unstructured sources. Implemented asynchronous scraping, data normalization, deduplication, and validation pipelines to ensure accuracy. Delivered actionable, real-time business intelligence through clean APIs and automated workflows.",
            "highlights": [
                "Developed and maintained scalable web applications using React, Angular, Vue, Laravel, MongoDB, and Express.js.",
                "Architected databases and deployed applications using modern DevOps practices.",
                "Optimized performance and implemented responsive UI/UX.",
                "Integrated third-party services such as Stripe, Firebase, and RESTful APIs.",
                "Contributed to several Shopify-based projects, including theme customization and layout changes using Liquid.",
                "Performed lightweight integrations with apps."
            ]
        }
    ],
    "skills": {
        "Frontend Development": [
            "React",
            "redux",
            "redux-thunk",
            "Next.js",
            "Angular",
            "Vue",
            "JavaScript",
            "TypeScript",
            "CSS",
            "HTML",
            "Bootstrap",
            "TailwindCSS",
            "Figma",
            "InvisionApp",
            "Zeplin"
        ],
        "Backend Development": [
            "Node.js",
            "NestJS",
            "Express",
            "Python",
            "Django",
            "Flask",
            "FastAPI",
            "RESTful APIs",
            "GraphQL",
            "Redis",
            "RabbitMQ",
            "TypeORM"
        ],
        "Database Management": [
            "MongoDB",
            "PostgreSQL",
            "MySQL",
            "MSSQL"
        ],
        "Testing and Debugging": [
            "Karma",
            "Jest",
            "Selenium",
            "Cypress",
            "Pytest"
        ],
        "Version Controlling System": [
            "Git",
            "Github",
            "Gitlab",
            "BitBucket"
        ],
        "Tools and DevOps": [
            "Docker",
            "Git",
            "GitHub Actions",
            "CircleCI",
            "AWS",
            "IPFS",
            "Heroku",
            "Vercel"
        ],
        "Project Management": [
            "Agile Methodology",
            "Jira",
            "Confluence"
        ],
        "Data Visualization": [
            "D3.js",
            "Chart.js"
        ]
    },
    "education": {
        "degree": "Bachelor of Software Engineering",
        "university": "Hong Kong Polytechnic University(PolyU), Hong Kong",
        "period": "SEP 2015 - SEP 2019",
        "description": "Major concentration in Software Development, Algorithm Design, and Database Management Systems with distinction."
    }
}