{
    "name": "JUN KAI LAM",
    "contact": {
        "GitHub": "https://github.com/webcat12345",
        "Email": "lamjunkai4@gmail.com"
    },
    "summary": "Senior Front End Engineer who thrives in building startups from the ground up, no matter the industry. I’ve led the development of sleek, high-performing web apps that scale, working remotely with global teams to deliver exceptional user experiences. Passionate about turning ideas into polished, responsive interfaces that drive growth.",
    "references": [
        {
            "name": "Puneet Mehta ( CEO, Netomi )",
            "text": "To whom it may concern - I, Puneet Mehta, CEO of Netomi and writing this ...",
            "link": "https://drive.google.com/file/d/1tuiE-HqV0qwPH5xnWe1PvcAUHzkPEjtY/view?usp=drive_link"
        },
        {
            "name": "Thomas Temeschinko ( Head of Engineering, UHP )",
            "text": "Jun worked with us at UHP as a Full Stack Developer from August 2017 till Jul 2020 and ...",
            "link": "https://drive.google.com/file/d/1l3xTS6SjNeLYwx1Pf-dbl4gDLCpxlxax/view?usp=drive_link"
        },
        {
            "name": "Peter Bagge ( Director of Technology, Thought Machine )",
            "text": "I am writing to enthusiastically recommend Jun Kai for a software engineering position. I enjoyed ...",
            "link": "https://drive.google.com/file/d/1U5-lgyzkYmBXPg1eNR0crgg6uPpQCSdQ/view?usp=sharing"
        }
    ],
    "experience": [
        {
            "title": "Director of Technology",
            "company": "Netomi",
            "period": "NOV 2022 - SEP 2025",
            "skills": [
                "React.js",
                "Next.js",
                "Angular",
                "Vue",
                "TailwindCSS",
                "Golang",
                "Nest.js",
                "Django",
                "AWS",
                "GCP",
                "TDD",
                "etc"
            ],
            "summary": "As a team lead of the business intelligence project. My role is managing the project from planning, development to release coordination. I have established best practices as well as work processes to ensure efficient development and rollout. Moreover, provide technical leadership to teammate. As a developer, integrate company website with various payment service providers. Provide cost and benefit analysis also risk assessment for different implementation approaches. Also, coordinate with vendor for technical issue and production set up.I collaborate with designers and backend developers to create seamless and user-friendly efficient user experiences.",
            "highlights": [
                "Led development of a high-performance web application, achieving 97% PageSpeed score through NextJS optimization, SEO improvements, and AWS infrastructure setup (Route53, CloudFront, EC2, ELB, RDS)",
                "Architected and deployed a microservices backend using NestJS and MongoDB, implementing API documentation with Swagger and CI/CD pipelines using GitHub Actions",
                "Built a DEX platform with React and Web3.js, integrating smart contracts for token swaps and liquidity provision with 99.9% uptime",
                "Developed a DAO platform using React and FastAPI, implementing proposal management and voting mechanisms with Web3.js integration",
                "Created a real-time trading dashboard with WebSocket integration, achieving sub-second data updates and handling 100K+ concurrent users",
                "Mentored junior developers, conducted code reviews, and established development standards that reduced bug reports by 40%",
                "Optimized database queries and implemented caching strategies, reducing API response times by 60%",
                "Designed and implemented secure authentication system using JWT and OAuth2, ensuring GDPR compliance",
                "Set up comprehensive monitoring using ELK stack and Grafana, reducing incident response time by 50%"
            ]
        },
        {
            "title": "Full Stack Developer",
            "company": "Thought Machine",
            "period": "AUG 2020 - OCT 2022",
            "skills": [
                "React.js",
                "Bootstrap",
                "Webpack",
                "InvisionApp",
                "Balsamiq",
                "CircleCI",
                "Jenkins",
                "AWS"
            ],
            "summary": "Built and maintained an AI-driven platform that supports business decision-making. Worked mainly on the frontend side with Angular, NgRx and rxjs. Built a microservice using NestJS on the backend side with RabbitMQ for messaging. Mentored junior guys to let them grow in a collaborative team environment.",
            "highlights": [
                "Developed scalable and performant web applications using React.js, Angular, Vue and TypeScript, improving load times by 25% and boosting customer satisfaction.",
                "Developed a real-time AI-powered task prioritization system using Angular and RxJS, improving team productivity by 30%",
                "Implemented WebSocket integration for live updates and notifications, handling 50K concurrent users",
                "Built reusable UI components library with NgRx state management, reducing development time by 40%",
                "Set up automated testing pipeline with Jest and Cypress, achieving 85% test coverage"
            ]
        },
        {
            "title": "Software Engineer",
            "company": "UHP",
            "period": "DEC 2017 - JUL 2020",
            "skills": [],
            "summary": "Contributed to building a Ticket Management System similar to ClickUp, built reusable components and integrated storybook for component testing. Collaborated with designers and product managers to ensure the interface was user-friendly and aligned with the business goals.",
            "highlights": [
                "Developed and maintained a ticket management system using React and Redux, serving 10K+ daily active users",
                "Created a component library with Storybook, improving team collaboration and reducing UI inconsistencies by 70%",
                "Implemented drag-and-drop functionality for ticket organization using React DnD, enhancing user experience",
                "Optimized frontend performance by implementing lazy loading and code splitting, reducing initial load time by 45%"
            ]
        },
        {
            "title": "Web Developer",
            "company": "Orient Overseas Container Line",
            "period": "OCT 2016 - NOV 2017",
            "skills": [],
            "summary": "Built and maintained a health insurance platform from the ground up. Used Laravel, Blade, jQuery, Bootstrap, MongoDB, RESTful API, Nginx, AWS.",
            "highlights": [
                "Completed a comprehensive internship program focused on web development, gaining hands-on experience in frontend and backend technologies, version control, and best practices",
                "Assisted senior developers in building and maintaining web applications, applying learned concepts and techniques to solve problems and deliver solutions",
                "Developed proficiency in HTML, CSS, JavaScript, and version control systems like Git during the internship program"
            ]
        }
    ],
    "skills": {
        "Frontend Development": [
            "React",
            "redux",
            "redux-thunk",
            "Next.js",
            "Angular",
            "Vue",
            "JavaScript",
            "TypeScript",
            "CSS",
            "HTML",
            "Bootstrap",
            "TailwindCSS",
            "Figma",
            "InvisionApp",
            "Zeplin"
        ],
        "Backend Development": [
            "Node.js",
            "NestJS",
            "Express",
            "Python",
            "Django",
            "Flask",
            "FastAPI",
            "RESTful APIs",
            "GraphQL",
            "Redis",
            "RabbitMQ",
            "TypeORM"
        ],
        "Web3 Technologies": [
            "Solidity",
            "Web3.js",
            "Ethers.js",
            "Smart Contracts"
        ],
        "Blockchain Platforms": [
            "Ethereum",
            "Polygon",
            "Solana",
            "Binance Smart Chain"
        ],
        "Decentralized Finance (DeFi)": [
            "DApps",
            "Decentralized Exchanges (DEX)",
            "Centralized Exchanges (CEX)",
            "NFT Marketplaces"
        ],
        "Database Management": [
            "MongoDB",
            "PostgreSQL",
            "MySQL",
            "MSSQL"
        ],
        "Smart Contract Development": [
            "Solidity",
            "Hardhat",
            "Truffle",
            "OpenZeppelin"
        ],
        "Testing and Debugging": [
            "Karma",
            "Jest",
            "Selenium",
            "Cypress",
            "Pytest"
        ],
        "Version Controlling System": [
            "Git",
            "Github",
            "Gitlab",
            "BitBucket"
        ],
        "Tools and DevOps": [
            "Docker",
            "Git",
            "GitHub Actions",
            "CircleCI",
            "AWS",
            "IPFS",
            "Heroku",
            "Vercel"
        ],
        "Project Management": [
            "Agile Methodology",
            "Jira",
            "Confluence"
        ],
        "Data Visualization": [
            "D3.js",
            "Chart.js"
        ]
    },
    "education": {
        "degree": "Bachelor of Software Engineering",
        "university": "Hong Kong Polytechnic University(PolyU), Hong Kong",
        "period": "SEP 2012 - SEP 2016",
        "description": "Major concentration in Software Development, Algorithm Design, and Database Management Systems with distinction."
    }
}